Show / Hide Table of Contents
Class Loading
Loading identification
Inheritance
System.Object
Loading
ResultOfLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class Loading
Constructors
Improve this Doc   View Source
Loading()
Constructor
Declaration
public Loading()
Improve this Doc   View Source
Loading(LoadingType, Int32)
Constructor
Declaration
public Loading(LoadingType loadingType, int id)
Parameters
 Type |  Name |  Description
 LoadingType |  loadingType
Type of loading
 System.Int32 |  id
Id of loading
Properties
Improve this Doc   View Source
Id
Id of loading
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
LoadingType
Type of loading
Declaration
public LoadingType LoadingType { get; set; }
Property Value
 Type |  Description
 LoadingType
 Improve this Doc
 View Source